src/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКомпоненты</Name>
					<Comment>Версия компоненты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПречековыйПринтер</Name>
					<Comment>BeforeCheckPrinters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
					<Comment>API</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПодключаемоеОборудование/Forms/ФормаНастройкиХеликсПречековыйПринтерКассира/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	
	времКодСимволаЧастичногоОтреза     = Неопределено;	
	времИмяПринтера    			       = Неопределено;
	времТаблицаШапкаЧека		       = Неопределено;
	времТаблицаПодвалЧека              = Неопределено;
	времШирина                         = Неопределено;
	времПредварительныйПросмотр    	   = Неопределено;
	времВыборПринтера            	   = Неопределено;
	времЧислоКопий               	   = Неопределено;
	времПечатьПриПробитии              = Неопределено;
	времИспользоватьФР            	   = Неопределено;
	времФискальныйРегистратор    	   = Неопределено;
	времШиринаФР                   	   = Неопределено;
	времВыводитьСтруктурнуюЕдиницу 	   = Неопределено;
	времВыводитьОстаткиНаЛицевыхСчетах = Неопределено;
	времВыводитьКомментарий			   = Неопределено;
	времПрефикс              	       = Неопределено;
	
	Параметры.ПараметрыОборудования.Свойство("КодСимволаЧастичногоОтреза"	 , времКодСимволаЧастичногоОтреза);	
	Параметры.ПараметрыОборудования.Свойство("ИмяПринтера"              	 , времИмяПринтера);
	Параметры.ПараметрыОборудования.Свойство("ТаблицаШапкаЧека"         	 , времТаблицаШапкаЧека);
	Параметры.ПараметрыОборудования.Свойство("ТаблицаПодвалЧека"        	 , времТаблицаПодвалЧека);
	Параметры.ПараметрыОборудования.Свойство("Ширина"                   	 , времШирина);
    Параметры.ПараметрыОборудования.Свойство("ПредварительныйПросмотр"  	 , времПредварительныйПросмотр);
	Параметры.ПараметрыОборудования.Свойство("ВыборПринтера"            	 , времВыборПринтера);
	Параметры.ПараметрыОборудования.Свойство("ЧислоКопий"               	 , времЧислоКопий);
	Параметры.ПараметрыОборудования.Свойство("ПечатьПриПробитии"        	 , времПечатьПриПробитии);
	Параметры.ПараметрыОборудования.Свойство("ИспользоватьФР"      			 , времИспользоватьФР);
	Параметры.ПараметрыОборудования.Свойство("ФискальныйРегистратор"    	 , ЭтотОбъект.ФискальныйРегитратор);
	Параметры.ПараметрыОборудования.Свойство("ШиринаЧекаФР"			     	 , времШиринаФР);
	Параметры.ПараметрыОборудования.Свойство("ВыводитьСтруктурнуюЕдиницу"	 , времВыводитьСтруктурнуюЕдиницу);
	Параметры.ПараметрыОборудования.Свойство("ВыводитьКомментарий"	         , времВыводитьКомментарий);
	Параметры.ПараметрыОборудования.Свойство("ВыводитьОстаткиНаЛицевыхСчетах", времВыводитьОстаткиНаЛицевыхСчетах);
	Параметры.ПараметрыОборудования.Свойство("ОтображатьЛоготип"			 , ЭтотОбъект.ОтображатьЛоготип);
	Параметры.ПараметрыОборудования.Свойство("ЛоготипОрганизации"			 , ЭтотОбъект.ФайлКартинки);
	Параметры.ПараметрыОборудования.Свойство("Префикс"                       , времПрефикс);
    
	КодСимволаЧастичногоОтреза 	   = ?(времКодСимволаЧастичногоОтреза     = Неопределено, 22	, времКодСимволаЧастичногоОтреза);
	ИмяПринтера                    = ?(времИмяПринтера                    = Неопределено, ""	, времИмяПринтера);
	ШиринаЧека               	   = ?(времШирина                         = Неопределено, 58	, времШирина);
	ПредварительныйПросмотр  	   = ?(времПредварительныйПросмотр        = Неопределено, Ложь	, времПредварительныйПросмотр);
	ВыборПринтера            	   = ?(времВыборПринтера                  = Неопределено, Ложь	, времВыборПринтера);
	ЧислоКопий               	   = ?(времЧислоКопий                     = Неопределено, 1		, времЧислоКопий);
	ПечатьПриПробитии       	   = ?(времПечатьПриПробитии              = Неопределено, Ложь	, времПечатьПриПробитии);
	ИспользоватьФР			 	   = ?(времИспользоватьФР        	      = Неопределено, Ложь	, времИспользоватьФР);
	ШиринаЧекаФР               	   = ?(времШиринаФР			              = Неопределено, 32	, времШиринаФР);
	ВыводитьСтруктурнуюЕдиницу 	   = ?(времВыводитьСтруктурнуюЕдиницу     = Неопределено, Истина, времВыводитьСтруктурнуюЕдиницу);
	ВыводитьКомментарий      	   = ?(времВыводитьКомментарий            = Неопределено, Ложь  , времВыводитьКомментарий);
	ВыводитьОстаткиНаЛицевыхСчетах = ?(времВыводитьОстаткиНаЛицевыхСчетах = Неопределено, Ложь	, времВыводитьОстаткиНаЛицевыхСчетах);
	Префикс              	       = ?(времПрефикс             		      = Неопределено, ""    , времПрефикс);
	
	Если времТаблицаШапкаЧека = Неопределено  Тогда
		ПолучитьТаблицуШапки();
	Иначе
		Для Каждого СтрокаТЧ из времТаблицаШапкаЧека Цикл		
			НоваяСтрока = ТаблицаШапкаЧека.Добавить();
			НоваяСтрока.ШапкаЧека = СтрокаТЧ;
		КонецЦикла;
	КонецЕсли;
	
	Если времТаблицаПодвалЧека = Неопределено Тогда
		ПолучитьТаблицуПодвала();
	Иначе  
		Для Каждого СтрокаТЧ из времТаблицаПодвалЧека Цикл		
			НоваяСтрока = ТаблицаПодвалЧека.Добавить();
			НоваяСтрока.ПодвалЧека = СтрокаТЧ;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВидимость();
	ПереопределитьСвязиПараметровВыбора();
	ПриИзмененииКартинки();
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("ОсновныеНастройки"		, "ГруппаОсновныеНастройки");
	СтруктураМеню.Вставить("ДополнительныеНастройки", "ГруппаДополнительныеНастройки");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПредварительныйПросмотрПриИзменении(Элемент)
	
	ВыборПринтера = Не ПредварительныйПросмотр;	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ВыборПринтераПриИзменении(Элемент)
	
	Если ВыборПринтера Тогда
		ИмяПринтера = "";
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ИмяПринтераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СпПринтеров = Новый СписокЗначений;
	WSHNetwork = Новый COMОбъект("WScript.Network");
	colDrives = WSHNetwork.EnumPrinterConnections();
	Если colDrives.Count()=0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Нет принтеров';en='Not printers'"),5);
	Иначе
		Для Index = 0 По colDrives.Count() - 1 Цикл
			СпПринтеров.Добавить(colDrives.item(Index), colDrives.item(Index + 1));
			Index =Index + 1;
		КонецЦикла;
	КонецЕсли;
	Если СпПринтеров.Количество()>0 Тогда
		ВыбПринтер = Неопределено;
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИмяПринтераНачалоВыбораЗавершение", ЭтотОбъект), СпПринтеров);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПринтераНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ВыбПринтер = ВыбранныйЭлемент; // выпадающий список
	Если ВыбПринтер <> Неопределено Тогда
		ИмяПринтера = ВыбПринтер;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПечтьПриПробитииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ИспользоватьФискальныйРегистраторПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ОтображатьЛоготипПриИзменении(Элемент)
	
	Элементы.ГруппаФото.Видимость = ЭтотОбъект.ОтображатьЛоготип;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет обработку нажатия динамических кнопок на сервере.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды
//
Процедура ЗаписатьИЗакрыть(Команда)
	                                               
	НовыеЗначениеПараметров = Новый	Структура();
	НовыеЗначениеПараметров.Вставить("КодСимволаЧастичногоОтреза"	 , КодСимволаЧастичногоОтреза);	
	НовыеЗначениеПараметров.Вставить("ИмяПринтера"					 , ИмяПринтера);
	НовыеЗначениеПараметров.Вставить("ТаблицаШапкаЧека"				 , ВернутьДанныеТаблицы(ТаблицаШапкаЧека, "ШапкаЧека"));
	НовыеЗначениеПараметров.Вставить("ТаблицаПодвалЧека"        	 , ВернутьДанныеТаблицы(ТаблицаПодвалЧека, "ПодвалЧека"));
	НовыеЗначениеПараметров.Вставить("Ширина"						 , ШиринаЧека);
	НовыеЗначениеПараметров.Вставить("ПредварительныйПросмотр"  	 , ПредварительныйПросмотр);
	НовыеЗначениеПараметров.Вставить("ВыборПринтера"				 , ВыборПринтера);
	НовыеЗначениеПараметров.Вставить("ЧислоКопий"					 , ЧислоКопий);
	НовыеЗначениеПараметров.Вставить("ПечатьПриПробитии"			 , ПечатьПриПробитии);
	НовыеЗначениеПараметров.Вставить("ИспользоватьФР"		 		 , ИспользоватьФР);
	НовыеЗначениеПараметров.Вставить("ФискальныйРегистратор"		 , ФискальныйРегитратор);
	НовыеЗначениеПараметров.Вставить("ШиринаЧекаФР"		 		 	 , ШиринаЧекаФР);
	НовыеЗначениеПараметров.Вставить("ВыводитьСтруктурнуюЕдиницу"	 , ВыводитьСтруктурнуюЕдиницу);
	НовыеЗначениеПараметров.Вставить("ВыводитьКомментарий"	         , ВыводитьКомментарий);
	НовыеЗначениеПараметров.Вставить("ВыводитьОстаткиНаЛицевыхСчетах", ВыводитьОстаткиНаЛицевыхСчетах);
	НовыеЗначениеПараметров.Вставить("ОтображатьЛоготип"			 , ЭтотОбъект.ОтображатьЛоготип);
	НовыеЗначениеПараметров.Вставить("ЛоготипОрганизации"			 , ЭтотОбъект.ФайлКартинки);
	НовыеЗначениеПараметров.Вставить("Префикс"			 		     , Префикс);
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Идентификатор"		   , Идентификатор);
	ПараметрыНастройки.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров); 

	Закрыть(ПараметрыНастройки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, выгружает данные колонки таблицы
//
Функция ВернутьДанныеТаблицы(Знач Таблица, Знач Колонка)
	
	Возврат Таблица.Выгрузить().ВыгрузитьКолонку(Колонка)	
	
КонецФункции

&НаСервере
// Процедура, выполняет установку доступности элементов
//
Процедура УстановитьВидимость()
	
	Элементы.ПредварительныйПросмотр.Видимость	= Истина;
	Элементы.ГруппаВыборПринтера.Видимость		= Не ПредварительныйПросмотр;	
	Элементы.ИмяПринтера.Видимость				= Не ПредварительныйПросмотр И Не ВыборПринтера;
	Элементы.ЧислоКопий.Видимость				= ПечатьПриПробитии;
	Элементы.ГруппаПараметрыПринтера.Видимость 	= Не ИспользоватьФР;	
	Элементы.ФискальныйРегитратор.Видимость     = ИспользоватьФР;
	Элементы.ШиринаЧекаФР.Видимость             = ИспользоватьФР;
	Элементы.ГруппаФото.Видимость 				= ЭтотОбъект.ОтображатьЛоготип;
	
КонецПроцедуры

&НаСервере
// Процедура для получения таблицы шапки чека
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <ТаблицаШапкаЧека> - Результат выполнения операции.
//
Процедура ПолучитьТаблицуШапки()
	
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "          Магазин 'Тест'";
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "          г.Москва";
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "";
		
КонецПроцедуры // ПолучитьТаблицуШапки()

&НаСервере
// Процедура для получения таблицы подвала чека
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <ТаблицаПодвалЧека> - Результат выполнения операции.
//
Процедура ПолучитьТаблицуПодвала()
	
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = "";
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = Нстр("ru = '         СПАСИБО!'; en = '         THANKS!'");
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = Нстр("ru = '         ВСЕГДА ВАМ РАДЫ!'; en = '         ALWAYS GLAD TO YOU!'");

КонецПроцедуры // ПолучитьТаблицуПодвала()

&НаСервере
// Процедура - Переопределить связи параметров выбора
//
Процедура ПереопределитьСвязиПараметровВыбора()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДрайверыОборудования.Ссылка КАК Драйверы
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования
	|ГДЕ
	|	(ДрайверыОборудования.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|			ИЛИ ДрайверыОборудования.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор))
	|	И ДрайверыОборудования.Ссылка <> ЗНАЧЕНИЕ(Справочник.ДрайверыОборудования.ДрайверКассовогоСервера)");
	
	МассивОтбираемыхДрайверов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Драйверы");
	
	МассивДрайверов = Новый Массив();
    МассивДрайверов.Добавить(Новый ПараметрВыбора("Отбор.ДрайверОборудования"   , Новый ФиксированныйМассив(МассивОтбираемыхДрайверов)));
	МассивДрайверов.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления"       , Ложь));
	МассивДрайверов.Добавить(Новый ПараметрВыбора("Отбор.УстройствоИспользуется", Истина));
	
	Элементы.ФискальныйРегитратор.ПараметрыВыбора = Новый ФиксированныйМассив(МассивДрайверов);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДобавленияЛоготипа

&НаСервере
// Процедура, устававливает видимость картинки
//
Процедура ПриИзмененииКартинки()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ФайлКартинки) Тогда
		Попытка
			АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ЭтотОбъект.ФайлКартинки);
			Элементы.АдресКартинки.РазмерКартинки = РазмерКартинки.Пропорционально;
		Исключение
			Элементы.АдресКартинки.Заголовок = НСтр("ru = 'Фото не найдено'; en = 'Photo not found'");
		КонецПопытки;
	Иначе
		АдресКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Фотоаппарат.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		Элементы.АдресКартинки.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	Конецесли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает навигационную ссылку картинки
//
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РаботаСФайламиСлужебный.ПолучитьНавигационнуюСсылкуВоВременномХранилище(ФайлКартинки.ТекущаяВерсия);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ФайлКартинки) Тогда
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ЭтотОбъект.ФайлКартинки);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВставитьИзФайла"
//
Процедура ВставитьИзФайла(Команда)
	
	#Если НЕ ВебКлиент Тогда
		ВставитьИзФайлаОбработка();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вставить из файла обработка
//
Процедура ВставитьИзФайлаОбработка()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Все графические файлы (*.jpg, *.jpeg, *.png, *.bmp, *.gif)|*.jpg; *.jpeg; *.png; *.bmp; *.gif|Рисунок JPEG (*.jpeg, *.jpg)|*.jpeg; *.jpg|Рисунок PNG (*.png)|*.png|Рисунок BMP (*.bmp)|*.bmp|Рисунок GIF (*.gif)|*.gif";		
	Диалог.МножественныйВыбор = Ложь;
	
	Диалог.Показать(Новый ОписаниеОповещения("ВставитьИзФайлаОбработкаЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));		
	
КонецПроцедуры

// Процедура - Вставить из файла обработка завершение
// Завершение процедуры - Вставить из файла обработка
// Параметры:
//  ВыбранныеФайлы			 - 	 Выбранные файлы 
//  ДополнительныеПараметры	 - 	 ПараметрыОповещения 
//
&НаКлиенте
Процедура ВставитьИзФайлаОбработкаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		Диалог = ДополнительныеПараметры.Диалог;
		ЭтотОбъект.ФайлКартинки = РаботаСФайламиКлиентСтоматология.СохранитьФото(Диалог.ВыбранныеФайлы[0], ЭтотОбъект.Идентификатор);
		
		РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(ЭтотОбъект.ФайлКартинки);
		
		
		
		ПриИзмененииКартинки();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
